# -*- coding: utf-8 -*-
"""
1. Дан список с месяцами months и пустые списки означающие времена года (winter - зима, spring - весна, summer - лето, autumn - осень).
2. Используя метод .append() наполните списки spring и autumn, обращаясь по индексу к списку months.
3. Используя метод .insert() наполните списки winter и summer, обращаясь по индексу к списку months.
4. Выведите все списки сезонов на экран.
"""
# Ваш код ниже
months = ["Январь", "Февраль", "Март", "Апрель", "Май", "Июнь", "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь", "Декабрь"]
winter = []
spring = []
summer = []
autumn = []
