# -*- coding: utf-8 -*-
"""
1. Дан список с месяцами months
2. Заменить каждый из месяцев списка months на англоязычное:
    Jan, Feb, Mar, Apr, May, Jun, Jul, Aug, Sep, Oct, Nov, Dec
3. Вывести измененный список на экран.
4. Для месяца вашего рождения сделать изменения в списке: сохранить его в верхнем регистре с применением метода upper().
5. Вывести список на экран.
"""
# Ваш код ниже
months = ["Январь", "Февраль", "Март", "Апрель", "Май", "Июнь", "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь", "Декабрь"]
