# -*- coding: utf-8 -*-
"""
Даны переменные:
    first_name, middle_name, last_name, full_name, message
1. В переменную first_name сохраните Выше имя
2. В переменную middle_name сохраните Ваше отчество
3. В переменную last_name сохраните Вашу фамилию
4. Подсчитайте количество букв:
    в имени (first_name);
    в отчестве (middle_name);
    в фамилии (last_name);
    всего;
5. В переменную full_name сохраните Ваше ФИО из переменных first_name, middle_name, last_name
6. Примените методы lower(), upper(), title() и capitzlize() к full_name и выведите на экран
"""

# Ваш код ниже
first_name = ""
middle_name = ""
last_name = ""
print("Количество букв в имени:", 0)
print("Количество букв в отчестве:", 0)
print("Количество букв в фамилии:", 0)
print("Общее количество букв в ФИО:", 0)
full_name = ""
print(full_name)
print("full_name lower -->", "")
print("full_name upper -->", "")
print("full_name title -->", "")
print("full_name capitzlize -->", "")
