# -*- coding: utf-8 -*-
"""
1. Дан список с месяцами months
2. Вывести на экран месяц Вашего рождения
3. Вывести на экран первый месяц в списке
4. Вывести на экран последний месяц в списке. Сделать его ЗАГЛАВНЫМИ буквами.
"""
# Ваш код ниже
months = ["Январь", "Февраль", "Март", "Апрель", "Май", "Июнь", "Июль", "Август", "Сентябрь", "Октябрь", "Ноябрь", "Декабрь"]
print("месяц Вашего рождения:", "")
print("первый месяц в списке:", "")
print("последний месяц в списке (ЗАГЛАВНЫМИ БУКВАМИ):", "")
