# -*- coding: utf-8 -*-
"""
1. Используя цикл while, напишите программу которая последовательно выводит на экран числа от 3 до 11
    Пример:
        3
        4
        5
        6
        7
        8
        9
        10
        11
"""
# Ваш код ниже

a = 3
while a != 12:
    a = int(input())
    a = a + 1
print(a)
