workers = [
    {"name": "Александр", "lastname": "Леонов", "age": 35, "role": "Менеджер по продажам",
     "achievements": ["Менеджер месяца (Март 2019)", "Лучшая промо активность (Апрель 2019)"]},
    {"name": "Иван", "lastname": "Петров", "age": 56, "role": "Охранник", "achievements": []},
    {"name": "Олег", "lastname": "Бубликов", "age": 32, "role": "Менеджер по продажам",
     "achievements": ["Менеджер месяца (Июнь 2019)", "Менеджер месяца (Июль 2019)",
                      "Лучший старт продаж нового бренда (Август 2019)"]},
    {"name": "Анна", "lastname": "Ветрова", "age": 27, "role": "Бухгалтер", "achievements": []},
    {"name": "Геннадий", "lastname": "Сталеваров", "age": 45, "role": "Директор",
     "achievements": ["Лучшее предприятие года (2017)", "Лучшее предприятие года (2018)",
                      "Лучшие показатели по дистрибьюции нового продукта XYZ (Март 2019)"]}
]
print(workers[0].get('achievements'))